In [2]:
#exp no:3

In [3]:
#aim: Creating the Dataframe

In [4]:
# Name :- sanskruti ajay chandore
# Roll no : 09
# Sec : C
# Subject : ET1
# Date : 01/08/25

In [5]:
#creating series

In [6]:
import pandas as pd

In [10]:
name=["sana","vaish","tanu","gayu","prerna"]

In [12]:
name

['sana', 'vaish', 'tanu', 'gayu', 'prerna']

In [14]:
roll_list=pd.Series(name,index=[1,2,3,4,5])
print(roll_list)

1      sana
2     vaish
3      tanu
4      gayu
5    prerna
dtype: object

In [15]:
#creating dataframe

In [16]:
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],columns=["DM","DSS","CAO","BIA"])

In [17]:
df

   DM  DSS  CAO  BIA
0  10   12   14   16
1  11   18   15   21
2  12   13   14   15

In [18]:
df.shape

(3, 4)

In [19]:
df.size

12

In [20]:
df.ndim

2

In [21]:
#adding record (row)to the data frame

In [22]:
df2=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],columns=["DM","DSS","CAO","BIA"])

In [27]:
df3=pd.concat([df,df2],ignore_index=True)

In [28]:
df3

   DM  DSS  CAO  BIA
0  10   12   14   16
1  11   18   15   21
2  12   13   14   15
3  10   12   14   16
4  11   18   15   21
5  12   13   14   15

In [29]:
#deleting record from df3 dataframe

In [30]:
df4=df3.drop(index=[1])

In [31]:
df4

   DM  DSS  CAO  BIA
0  10   12   14   16
2  12   13   14   15
3  10   12   14   16
4  11   18   15   21
5  12   13   14   15

In [32]:
#adding attribute(colums)to data framne

In [43]:
df3["Dbms"]=[11,22,33,44,55,77]

In [44]:
df3

   DM  DSS  CAO  BIA  Dbms
0  10   12   14   16    11
1  11   18   15   21    22
2  12   13   14   15    33
3  10   12   14   16    44
4  11   18   15   21    55
5  12   13   14   15    77

In [45]:
#deleting attribute(columns)from df3 dataframe

In [46]:
df5=df3.drop(columns=["DM"])

In [47]:
df5

   DSS  CAO  BIA  Dbms
0   12   14   16    11
1   18   15   21    22
2   13   14   15    33
3   12   14   16    44
4   18   15   21    55
5   13   14   15    77

In [48]:
print("mean od DSS:",df5["DSS"].mean())

mean od DSS: 14.333333333333334

In [49]:
print("median of DSS:",df5["DSS"].median())

median of DSS: 13.0

In [50]:
print("mode of DSS:",df5["DSS"].mode())

mode of DSS: 0    12
1    13
2    18
dtype: int64